app/controllers/api/v1/trails_controller.rb

  def index
    trails = Trail.all
---
SELECT "trails".* FROM "trails"

  def create

    @trail = Trail.new(trail_params)

    if @trail.save
      render json: {
        status: "found",
        trail: @trail, except: [:created_at, :updated_at]
      }, status: :created, location: api_v1_trail_path(@trail)
    else
      render json: {
        Status: "lost...",
        error: @trail.errors.full_messages.join(", ")
---
INSERT INTO "trails" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Doll Head Trail"], ["created_at", "2021-05-28 17:49:44.261629"], ["updated_at", "2021-05-28 17:49:44.261629"]]
SELECT "trails".* FROM "trails"

  def update

    if @valet.update(valet_params)
---
UPDATE "valets" SET "fixed" = ?, "updated_at" = ? WHERE "valets"."id" = ?  [["fixed", 1], ["updated_at", "2021-05-28 16:11:33.731463"], ["id", 4]]

    def set_trail
      @trail = Trail.find(params[:id])
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_valet
      @valet = Valet.find(params[:id])
---
SELECT "valets".* FROM "valets" WHERE "valets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]