app/controllers/api/v1/trails_controller.rb

    def set_trail
      @trail = Trail.find(params[:id])
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]