app/controllers/valets_controller.rb

INSERT INTO "valets" ("location", "issue", "trail_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["location", "everywhere"], ["issue", "big rocks"], ["trail_id", 1], ["created_at", "2021-05-27 20:48:10.593495"], ["updated_at", "2021-05-27 20:48:10.593495"]]
---
  def create
    @valet = Valet.new(valet_params)

    if @valet.save

UPDATE "valets" SET "fixed" = ?, "updated_at" = ? WHERE "valets"."id" = ?  [["fixed", 1], ["updated_at", "2021-05-28 16:17:17.176300"], ["id", 1]]
---
  def update
      if @valet.update(valet_params)

SELECT "valets".* FROM "valets" WHERE "valets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_valet
      @valet = Valet.find(params[:id])