app/controllers/valets_controller.rb

  def update
    if @valet.update(valet_params)
---
UPDATE "valets" SET "fixed" = ?, "updated_at" = ? WHERE "valets"."id" = ?  [["fixed", 1], ["updated_at", "2021-05-26 17:37:09.576419"], ["id", 1]]

    def set_valet
      @valet = Valet.find(params[:id])
---
SELECT "valets".* FROM "valets" WHERE "valets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]